# Generic Zone Create Space Based Method

Source: https://www.revitapidocs.com/2026/db52b16e-3f63-9f89-64d4-7e15d2fcf909.htm

---

| Generic Zone Create Space Based Method |
| --- |

**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static GenericZone CreateSpaceBased(
	Document doc,
	ElementId typeId,
	string name,
	GenericZoneDomainData domainData,
	ElementId levelId,
	ISet<ElementId> spaceIds
)
```

```
Public Shared Function CreateSpaceBased (
	doc As Document,
	typeId As ElementId,
	name As String,
	domainData As GenericZoneDomainData,
	levelId As ElementId,
	spaceIds As ISet(Of ElementId)
) As GenericZone
```

```
public:
static GenericZone^ CreateSpaceBased(
	Document^ doc,
	ElementId^ typeId,
	String^ name,
	GenericZoneDomainData^ domainData,
	ElementId^ levelId,
	ISet<ElementId^>^ spaceIds
)
```

```
static member CreateSpaceBased :
        doc : Document *
        typeId : ElementId *
        name : string *
        domainData : GenericZoneDomainData *
        levelId : ElementId *
        spaceIds : ISet<ElementId> -> GenericZone
```

#### Parameters

doc Document
typeId ElementId
name String
domainData GenericZoneDomainData
levelId ElementId
spaceIds ISet ElementId

#### Return Value

GenericZone See Also

#### Reference

GenericZone Class Autodesk.Revit.DB.Analysis Namespace